src/template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantSimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1000;
//endTime         2500;

deltaT          1;

writeControl    timeStep;
writeInterval   100;
purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

// Passive Scalar
functions{
    scalar1{
       type scalarTransport;
       libs            (solverFunctionObjects);
       fields s;        // name of scalar 
//       region air; //
       nCorr  0;         // number of corrector loop
       D      1;     // diffussion coefficient
       writeControl    timeStep;
//       writeControl    adjustable;
       writeInterval   100;
       purgeWrite 0;
    }
}

// ************************************************************************* //
