src/template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

#include "inc/userBlockMesh"

// rotate 
/*
xc    #eval{ ($minx+$maxx)*0.5 };
yc    #eval{ ($miny+$maxy)*0.5 };
rad   #eval{ degToRad($ang) };

x1    #eval{ cos($rad)*$minx - sin($rad)*$miny + $xc };
y1    #eval{ cos($rad)*$minx + sin($rad)*$miny + $yc };
x2    #eval{ cos($rad)*$maxx - sin($rad)*$miny + $xc };
y2    #eval{ cos($rad)*$maxx + sin($rad)*$miny + $yc };
x3    #eval{ cos($rad)*$maxx - sin($rad)*$maxy + $xc };
y3    #eval{ cos($rad)*$maxx + sin($rad)*$maxy + $yc };
x4    #eval{ cos($rad)*$minx - sin($rad)*$maxy + $xc };
y4    #eval{ cos($rad)*$minx + sin($rad)*$maxy + $yc };
*/


vertices
(
    ($x1 $y1 $minz)
    ($x2 $y2 $minz)
    ($x3 $y3 $minz)
    ($x4 $y4 $minz)
    ($x1 $y1 $maxz)
    ($x2 $y2 $maxz)
    ($x3 $y3 $maxz)
    ($x4 $y4 $maxz)
);

blocks
(
//    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 3)

      hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (
                   (   (0.25 0.15 0.25)
                       (0.5  0.7  1) 
                       (0.25 0.15 4)  )
                   (   (0.25 0.15 0.25)
                       (0.5  0.7  1) 
                       (0.25 0.15 4)  )
                    4
                    )
);

edges
(
);

boundary
(
    Nwall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    Swall
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    Wwall
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    Ewall
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    Bottom
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    Top
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
