src/template/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
//    equationOfState perfectGas;
    equationOfState Boussinesq;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       28.96;
    }

//  Boussinesq
    equationOfState
    {
        beta            0.0032;// 1.2e-4; //
        rho0            1.227;
        T0              300;
    }
//

    thermodynamics
    {
        Cp              1004.4;
        Hf              0;
    }

    transport
    {
        mu              1.831e-00;
//        mu              1.831e-05;         // Original
        Pr              0.705;
    }
}


// ************************************************************************* //
