src/template/0.orig/inc/userAlphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
}

    building
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    land
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    green
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

