src/template/0.orig/inc/userNut
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
}

    building                 // building
    {
        type            atmNutkWallFunction;
        z0              uniform 0.1;              // Roughness Height
        value           $internalField;
    }

    land                 // grounds
    {
        type            atmNutkWallFunction;
        z0              uniform 0.1;              // Roughness Height
        value           $internalField;
    }

    green                 // grounds
    {
        type            atmNutkWallFunction;
        z0              uniform 0.1;              // Roughness Height
        value           $internalField;
    }
