src/template/0.orig/inc/userPrgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
}

    Ewall                // outlet wall
    {
        type            fixedValue;
        value           $internalField;
    }

