src/template/0.orig/inc/userT
300                          // Inlet Temperature (K)
building       0.7           // user input STL & emissivity
land           0.7           // user input STL & emissivity
green          0.3           // user input STL & emissivity
