src/template/0.orig/inc/userT_0
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
}

//                    Set Ref. Temparature (K). Fixed Value

refT   299;

