src/template/0.orig/inc/userT_1
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
}

//                    Set Uer Input Temparature (K)

internalField   uniform 300;

