src/template/0.orig/inc/userU_1
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
}

internalField   uniform (0 0 0);    // initial Velocity Zero Set

