src/template/0.orig/inc/userU_2
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
}

    Wwall                          // inlet wall
    {
        type            exprFixedValue;
        value           $internalField;
        U0              -2.0;              // User Input Velocity (NEGATIVE)
        MINZ               0;              // User Input MINZ
        N0              0.27;              // Power CONSTAT Value
        Z0              10.0;              // (m)   CONSTAT Value
        valueExpr       "$U0*pow((pos().z()-$MINZ)/$Z0,$N0)*face()/area()";
    }


    Ewall                          // outlet wall
    {
            type pressureInletOutletVelocity;
            value $internalField;;
    }

    building                           // building
    {
        type            noSlip;
    }

    grounds                           // grounds
    {
        type            noSlip;
    }

    land                              // grounds
    {
        type            noSlip;
    }
