src/template/system/inc/userSnappyHexMesh_2
    features
    (

        {
            file "building.eMesh";
            level $mlevel;
        }    


        {
            file "land.eMesh";
            level $mlevel;
        }    

        {
            file "green.eMesh";
            level $mlevel;
        }    

    );