src/template/system/inc/userSnappyHexMesh_3
    locationInMesh (47005.000000 -73149.000000 119.000000);