src/template/system/inc/userSurfaceFeatureExtract
building.stl                            // Set User stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;

    subsetFeatures
    {
        nonManifoldEdges       no;
        openEdges       yes;
    }
}

land.stl                            // Set User stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;

    subsetFeatures
    {
        nonManifoldEdges       no;
        openEdges       yes;
    }
}

green.stl                            // Set User stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;

    subsetFeatures
    {
        nonManifoldEdges       no;
        openEdges       yes;
    }
}
